{
    "title": "Mutton Jehangiri Korma",
    "image": "muttonJehangiriKorma.jpeg",
    "ingredients": [
        {"name": "0", "quantity": "500g"},
        {"name": "1", "quantity": "500g"},
        {"name": "2", "quantity": "1 tbsp"},
        {"name": "3", "quantity": "1/2 tbsp"},
        {"name": "4", "quantity": "2 tbsp"},
        {"name": "5", "quantity": "2 tbsp"},
        {"name": "6", "quantity": "5 tbsp"},
        {"name": "7", "quantity": "10 tbsp"},
        {"name": "8", "quantity": "3tbsp"},
        {"name": "9", "quantity": "1 cup"},
        {"name": "10", "quantity": "10 strands"},
        {"name": "11", "quantity": "5 drops"},
        {"name": "12", "quantity": "for garnish"},
        {"name": "13", "quantity": "for garnish"},
        {"name": "14", "quantity": "4 pieces"},
        {"name": "15", "quantity": "500 ml and surplus"},
        {"name": "16", "quantity": "2 tbsp"},
        {"name": "17", "quantity": "3 pieces"},
        {"name": "18", "quantity": "10 pieces"},
        {"name": "19", "quantity": "2 tbsp"},
        {"name": "20", "quantity": "1 flower"},
        {"name": "21", "quantity": "1 inch"},
        {"name": "22", "quantity": "0.5 inch"}
    ],
    "procedure": [
        "Warm the milk and put saffron and kewra water in it. This will be our aromatic that will be used in the end.",
        "In a pressure cooker, take 2 table spoons of mustard oil and heat it till it fumes.",
        "Drop in the Cardamom, Cinnamon, Peppercorns, Cloves, Black Cumins and Mace in the pressure cooker. Grate the nutmeg into it too.",
        "Now drop in the lamb trotters in the pressure cooker. Fry for 5 minutes.",
        "Then add 500 ml of water into it and close the lid of the pressure cooker once the water starts to boil.",
        "Let the trotters cook in the pressure cooker for 15 minutes.",
        "In a Kadhai or a Wok, pour the rest of the mustard oil and let it heat till it fumes. Then turn the heat to low.",
        "Add Onions and Lamb shanks into the Kadhai and a tablespoon of salt. Mix it up with a spatula and turn the heat back on to high again.",
        "In the mean time, take a cup and pour in the ghee. Add the turmeric powder, red chilli powder and coriander powder to it. Pour in few tablespoons of water till it forms a pasty consistency.",
        "After the onions turn brown due to carmelization, put the ginger garlic paste to the kadhai. Mix it thoroughly.",
        "Now fry till there is no fragrance of ginger garlic paste anymore.",
        "Then add in the curd (beaten) to the Kadhai and keep stirring it till you see no trace of curd left.",
        "Bring the flame to low and add in the spice paste. It is essential to turn the flame to low since heat can burn the spice mix.",
        "Meanwhile, strain the contents of pressure cooker to be left with just the broth.",
        "After 5 minutes of frying kadhai once spice mix was added, pour in the broth and simmer the content for an hour with a lid on.",
        "Make sure to check the content and stir it in short intervals. If the content seems to be getting very pasty, pour in some water.",
        "After an hour, add in the Kasoori Mehti and milk with Saffron and Kewra water in it.",
        "Let the content simmer for 30 more minutes meanwhile, correcting the consistency to your liking.",
        "At the end of 30 minutes, check for salt and correct it to your liking. Then garnish it with coriander leaves.",
        "The dish is now ready. Serve it with any carbohydrate of your choice. But it tastes best with Mughlai Paratha (Ulti tava paratha)."
    ]
}